//-----------------------------------【头文件包含部分】---------------------------------------  
//     描述：包含程序所依赖的头文件  
//---------------------------------------------------------------------------------------------- 
#include <opencv2/opencv.hpp>
#include <opencv2/highgui/highgui.hpp>
#include <opencv2/imgproc/imgproc.hpp> 

//-----------------------------------【命名空间声明部分】---------------------------------------  
//     描述：包含程序所使用的命名空间  
//-----------------------------------------------------------------------------------------------   
using namespace cv;  

//-----------------------------------【main( )函数】--------------------------------------------  
//     描述：控制台应用程序的入口函数
//-----------------------------------------------------------------------------------------------  
int main( )  
{  
	//载入原图  
	Mat srcImage=imread("1.jpg");  
	//显示原图  
	imshow("origin image", srcImage ); 
	Mat dstImage,edge,grayImage;//定义参数
	//创建矩阵
	dstImage.create( srcImage.size(), srcImage.type());
	//转为灰度图像
	cvtColor(srcImage, grayImage,COLOR_RGB2GRAY);
	//降噪
	blur(grayImage, edge, Size(3,3));
	//运行Canny算子
	Canny(edge, edge, 3, 9, 3);
	//显示效果图  
	imshow("效果 腐蚀后\n" ,edge);  

	waitKey(0 );      
} 